#####################################################################################################################
##################################################### Data: #########################################################
#####################################################################################################################
class CPupil:
    surname = None
    name = None
    login = None

    def __init__(self, surname, name, login):
        self.surname = surname
        self.name = name
        self.login = login
#####################################################################################################################
##################################################### Funcs: ########################################################
#####################################################################################################################
def main():
    pupils_count = int(input("Количество учащихся: "))
    if pupils_count > 100:
        print("Учеников больше 100!")
        exit(1)

    logins_dict = dict()
    pupils_list = []

    print("Введите имена учеников:")
    pupil_index = 0
    while pupil_index < pupils_count:
        full_name = input()
        surname, name = full_name.split(" ")

        if len(surname) > 20:
            print("Фамилия слишком длинная!")
            print("Повторите попытку ввода.")
            continue

        if len(name) > 15:
            print("Имя слишком длинное!")
            print("Повторите попытку ввода.")
            continue

        login = None
        if surname not in logins_dict:
            logins_dict[surname] = 1
            login = surname
        else:
            logins_dict[surname] += 1
            login = surname + str(logins_dict[surname])

        pupils_list.append(CPupil(surname, name, login))

        pupil_index += 1

    print("Логины:")
    for pupil in pupils_list:
            print(pupil.login)
#####################################################################################################################
##################################################### Exec: #########################################################
#####################################################################################################################
main()